000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.  'DRESSPRT'.
000300
000400 ENVIRONMENT DIVISION.
000500
000600 CONFIGURATION SECTION.
000700
000800 SOURCE-COMPUTER.  IBM-360.
000900 OBJECT-COMPUTER.  IBM-360.
001000 SPECIAL-NAMES.
001100     CONSOLE IS CNSL.
001200
001300 INPUT-OUTPUT SECTION.
001400
001500 FILE-CONTROL.
001600     SELECT INFILE
001700        ASSIGN TO UT-S-INFIL.
001800
001900     SELECT OUTFILE
002000        ASSIGN TO UT-S-OUTFIL.
002100
002200
002300 DATA DIVISION.
002400
002500 FILE SECTION.
002600 FD  INFILE
002700     RECORDING MODE IS F
002800     RECORD CONTAINS 81 CHARACTERS
002900     BLOCK  CONTAINS 100 RECORDS
003000     LABEL RECORDS ARE OMITTED
003100     DATA RECORD IS INREC.
003200 01  INREC               PIC X(81).
003300
003400 FD  OUTFILE
003500     RECORDING MODE IS F
003600     RECORD CONTAINS 80 CHARACTERS
003700     BLOCK  CONTAINS 49 RECORDS
003800     LABEL RECORDS ARE OMITTED
003900     DATA RECORD IS OUTREC.
004000 01  OUTREC              PIC X(80).
004100
004200
004300 WORKING-STORAGE SECTION.
004400*------------------------*
004500
004600 01  SW-SWITCHES.
004700     05 EOF-IND             PIC X VALUE SPACE.
004800        88 SW-EOF                 VALUE 'Y'.
004900
005000 01  CH-VAR.
005100     05 CH-OVL.
005200        10 CH-PRT-CTL       PIC X.
005300        10 CH-PAYLOAD       PIC X(80).
005400
005500 01   CH-CONST.
005600      05 CC-FF              PIC X VALUE '1'.
005700
005800
005900 PROCEDURE DIVISION.
006000*-------------------*
006100
006200 00-MAINLINE.
006300     PERFORM 10-SETUP  THROUGH 10-EXIT
006400     PERFORM 20-LOOP   THROUGH 20-EXIT
006500         UNTIL SW-EOF
006600     PERFORM 30-FINISH THROUGH 30-EXIT
006700     STOP RUN.
006800
006900*                     Might want to test file status ?
007000 10-SETUP.
007100     DISPLAY 'DRESSPRT FBA81->FB80, Dropping PAGE' UPON CNSL
007200     OPEN INPUT INFILE
007300     OPEN OUTPUT OUTFILE
007400     READ INFILE INTO CH-OVL
007500          AT END MOVE 'Y' TO EOF-IND.
007600
007700 10-EXIT.
007800     EXIT.
007900
008000*
008100 20-LOOP.
008200     IF CH-PRT-CTL IS NOT EQUAL TO CC-FF THEN
008300        WRITE OUTREC FROM CH-PAYLOAD.
008400     READ INFILE INTO CH-OVL
008500          AT END MOVE 'Y' TO EOF-IND.
008600
008700 20-EXIT.
008800     EXIT.
008900
009000*
009100 30-FINISH.
009200     CLOSE INFILE
009300     CLOSE OUTFILE.
009400
009500 30-EXIT.
009600     EXIT.
