//UNNUM1   EXEC PGM=IKJEFT01,REGION=0M
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSTSIN  DD *
EDIT 'MYUSER.JCLDUMP' OLD NOSCAN DATA
     RENUM 1 1
     UNNUM
     SAVE
END
/*
